ЕСКД/src/AccumulationRegisters/mega_ЗавкиВнутренниеКРазмещению/mega_ЗавкиВнутренниеКРазмещению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>mega_ЗавкиВнутренниеКРазмещению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПотребности</name>
    <type>
      <types>DocumentRef.mega_ЗаявкаВнутренняя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.mega_Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕСКД/src/AccumulationRegisters/mega_ЗавкиВнутренниеКРазмещению/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыполнитьДвижение(Регистратор, ВыборкаИзРезультатаЗапроса)Экспорт
	ВыборкаИзРезультатаЗапроса.Сбросить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		Движение = НаборЗаписей.Добавить();						
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаИзРезультатаЗапроса);		
		Движение.Количество = Справочники.mega_ЕдиницыИзмерения.ПеревестиИзЕдиницыВЕдиницу(
			ВыборкаИзРезультатаЗапроса.Количество, ВыборкаИзРезультатаЗапроса.ЕдиницаИзмерения, ВыборкаИзРезультатаЗапроса.ЕдиницаХранения);
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
	Возврат Истина;
КонецФункции

Функция ПолучитьОстатки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗавкиВнутренниеКРазмещениюОстатки.Номенклатура КАК Номенклатура,
		|	ЗавкиВнутренниеКРазмещениюОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.mega_ЗавкиВнутренниеКРазмещению.Остатки КАК ЗавкиВнутренниеКРазмещениюОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
